;*****************[ Local variables ]***********************************************

;DEF Temp     = r16
.DEF E_Data   = r21
.DEF E_Addr   = r22

;*****************[ Functions ]*****************************************************

;-----------------------------------------------------------------------------------

EEPROM_Write:
   ;Ожидание завершения предыдущей записи
   sbic  EECR,EEWE
   rjmp  EEPROM_Write    
   ;Установка адреса
   ;out   EEARH,EE_AdrH
   out   EEARL,E_Addr
   ;Запись данных
   out   EEDR,E_Data
   ;Установка EEMWE
   sbi   EECR,EEMWE
   ;Запуск записи (установка EEWE)
   sbi   EECR,EEWE
   ret

;-----------------------------------------------------------------------------------

EEPROM_Read:
   ;Ожидание завершения предыдущей записи
   sbic  EECR,EEWE
   rjmp  EEPROM_Read
   ;Установка адреса
   ;out   EEARH,EE_AdrH
   out   EEARL,E_Addr
   ;Запуск чтения (установка EERE)
   sbi   EECR,EERE
   ;Чтение данных
   in    E_Data,EEDR
   ret

;-----------------------------------------------------------------------------------
